// Романов Данил ПС-22. CLion
//
// 26. Информация  о  файлах  на  жестких  дисках   компьютера
//     записана  с  помощью  дерева.  Обеспечить выполнение следующих
//     операций:
//          1) загрузку дерева в память из файла;
//          2) обход дерева папок в  режиме  диалога  (раскрытие папок,
//             подъем на уровень и т. п.);
//          3) корректировку  дерева при создании новых папок и файлов,
//             их переименовании, копировании, переносе и удалении.
//          4) сохранение дерева в файле (13).

#include "include/app/App.h"

#include <iostream>

int main(int argc, char* argv[]) {
    if (argc < 3) {
        std::cout << "использование: " << argv[0] << " <input_file> <output_file>\n";
        return 1;
    }

    std::string inputFile = argv[1];
    std::string outputFile = argv[2];

    App app;
    app.run(inputFile, outputFile);
}
